{
  "prologue": {
    "text": "Зимний ветер свистит вокруг, разнося мерзлоту в воздухе. Земля погрязла в снегу, а города, когда-то шумные и пульсирующие жизнью, теперь обращены в архитектурные трупы, которые поглотил холод. В глубинах этого замерзшего мира, где тени длиннее, чем дни, момент когда мрак окутал все живое на земле волею судеб  как раз совпал с твоим плановым рейсом, поэтому с тех пор как на землю опустилась ядерная зима ты просто ведешь свой поезд пока видишь пред собою рельсы!\nТы - капитан последнего бесконечного поезда, метущегося сквозь заснеженные пустоши.\n\nНа борту твоего поезда таится надежда в виде оставшихся в живых, замерзших до мозга костей людей. Они остались без дома, без света и без тепла. Твоя задача - не просто капитанствовать над металлическим чудовищем, но и быть лидером, строителем будущего для этих людей.\n\nВ поисках убежища вы приходите к решению о создании последней оплота человечества. Замерзшие руки будут выстраивать стены, измученные тела будут добывать ресурсы из заснеженной пустоты, а твое руководство определит, сможет ли этот остаток цивилизации выжить во мраке холода и ядерных теней.\n\nТы - капитан, ты - надежда, и в этом замерзшем, угасающем мире именно ты должен проложить путь к выживанию..."
  },
  "STAGE_0": {
    "text": "Сердце поезда, его металлическое ядро, вдруг замерло в абсолютно голой пустоши, и наступила оглушающая тишина, словно огромное чудовище, измученное последними крохами запаса угля и последними электронами резервных аккумуляторов. Теперь, в этом хладнокровном мире, остался только ты - капитан последнего поезда, и 111 душ, включая детей, чьи глаза сверкают во мраке неизвестности.\nСуровый ветер пронизывает до костей, а снег метет вокруг так будто лета на земле никогда и в помине не бывало, заметая следы и покрывая все вокруг белым покровом. Задача невероятно сложна и нетривиальна: если численность общины упадет ниже 33 человек, то выжить будет невозможно! От твоих решений зависит судьба общины.\n\nПеред тобой четыре пути:\n\n1. Собрать вещи и отправиться на поиски убежища:\nСобери вместе с людьми все, что может пригодиться в пути. Надень на себя каждую доступную одежду, возьми инструменты и снаряжение. Поведи свой народ сквозь снежные пустоши, в поисках нового дома.\n\n2. Отправить разведчиков:\nВыбери 16 человек в роли разведчиков. Они пойдут по 4 человека на каждую из сторон света. Если судьба будет благосклонна, кто-то из них вернется с хорошими новостями, а остальные останутся ждать несколько дней в поезде, наблюдая за окружающей обстановкой. Это может предоставить ценную информацию о потенциальных угрозах и возможных убежищах.\n\n3. Вернуться на пролог:\nЕсли сомневаешься в своем выборе или хочешь переосмыслить свою стратегию, вернись на шаг назад. Взвесь свои решения и возможности.\n\nРестарт:\n4. Если ситуация кажется безвыходной или ты хочешь начать все заново, нажми эту кнопку. Новое начало, новые решения, новые шансы на выживание.\n\nТвои решения определят судьбу тех, кто остался, и будут записаны в хрониках последнего пристанища человечества."
  },
  "STAGE_1": {
    "text": "На поезде царило напряжение, страх голода неотступно сжимал сердца выживших. С каждым прошедшим часом промедления и сборов надежда таяла, как снег под лучами умирающего солнца.\n\nПока ветер завывал за окнами и бескрайние снежные поля терялись за  горизонтом, среди оставшихся в живых, так ни к месту возникли непримиримые разногласия, что вылились в потасовку. Тень холода нарушила тщедушный союз, и люди поддались панике.\n\n в Результате учиненного погрома, тринадцать человек погибли, еще трое исчезли, прихватив с собой изрядный запас общего провианта и снаряжения...\n\nДолгая дорога и отсутствие каких либо благоприятных перспектив в обозримом будущем вылились в рукоприкладство, мародерство и потерю близких. Голод и холод вечные спутники смерти, стали тяжелым бременем, и это привело к потере части пассажиров.\n\nСилы иссякли, и решение пришло само собой: Те, кто остался, объединились в последний отряд выживших. Снаряженные, готовые к борьбе за выживание, они отправились в снежные пустоши в поисках нового дома.\n\nТы, был капитаном последнего поезда, теперь ты капитан последнего ковчега, ты стоишь во главе этой группы, ты не выбирал свою судьбу, но она предопределила тво рок! надежда еще не угасла! но с каждым новым шагом возникает вопрос: сможете ли вы найти приют в уродливом искаженном отражении некогда прекрасного, зеленого, теплого мира что мы называли Планета Земля?\n\nВыбери следующий шаг:\n\n1. Идти на юг...\n\n2. Идти на север..."

  },
  "STAGE_2": {
    "text": "Разведчики во главе с тобой отправились в пустоши, разбившись на четыре группы, стремясь узнать больше о мире в котором они очутились далеко не по своей воле.\n\nПервая группа, несмотря на свою решимость, столкнулась с трагической участью всего через несколько часов. Углубившись в снежные просторы, они не заметили глубокую расщелину в снегу, ставшую для них последним пристанищем.\n\nСудьба второй группы остается тайной за семью печатями. Последние сводные данные говорят лишь о том, что связь с ними была потеряна. Исчезнув без следа, они стали загадкой в хрониках выживания.\n\nТретья группа, шагая сквозь белые просторы, наткнулась на небольшую группу людей, которые как и наши герои скитались в поисках капельки тепла , новые спутники убедили наших разведчиков присоединиться к ним,  не возвращаться в поезд и поискать счастья за горизонтом. Веря в обещание новой надежды, разведчики решают следовать за этой группой, оставив позади своих собратьев в поезде.\n\nСпустя километры пути, ценою невероятных усилий тебе вместе с твоими товарищами по несчастью наконец улыбается удача ! перед тобой открывается вид на идеальное место для поселения - лощина, окруженная холмами и деревьями которые смогут защитить от порывов ледяной бури и обеспечат стройматериалами для жилищ! Большая удача, потенциальное пристанище как будто бы найдено. Однако радость сменяется страхом, когда вы обнаруживаете, что лощина уже занята полярными медведями. Выбор между безопасностью возвращения за основной группой и перспективой обосновать временный лагерь и наконец обогреться, передохнуть, собраться с силами перед обратной дорогой становится более сложным, чем когда-либо.\n\nТы, капитан последнего поезда, стоишь перед сложным решением. Каков будет следующий шаг в твоей борьбе за выживание и будущее человечества?\n\n1. Рискнуть и попытаться прогнать медведей, чтобы завоевать лощину.\n\n 2. Вернуться за помощью в поезд, предупредив об опасности."
  },
  "STAGE_3": {
    "text": "Выбрав идти на север, вы были полны решимости и беспечности, не осознавая, что там, куда вы направились, холод несравненно жестче. С каждым пройденным днем потери становились непоправимыми,  многие из нас просто отставали и терялись во мгле. Остатки провизии таяли на глазах, а обещанная теплота нового дома казалась далеким сном.\n\nПервыми погибли дети, беспомощные перед суровой стихией. Многие взрослые, не справившись с потерей,попросту ложились рядом с остывающими трупами своих детей, забывшись наконец в сладкой дреме.\n\nПровизия иссякла, и люди были вынуждены съесть единственную выжившую пару собак. Затем начался каннибализм,  каждый новый шаг становился борьбой за выживание. Порой люди просто уходили во мрак ночи, не в силах вынести безжалостность этого мира. В конце концов, осталось меньше 30 человек.\n\nЛюди, отчаявшись и признав, что не смогут выжить в таких условиях, возложили всю тяжесть ответственности на тебя. Разделили тебя, облили холодной водой и оставили умирать на холодном снегу. Что ж говорят смерть от холода не так уж и плоха, похожа на сон, под конец как будто бы становится даже теплее...\n\n\n\n  Конец игры.\n\n Ты не справился с возложенной задачей, ну что ж спи спокойно капитан! по крайней мере ты попытался..."
  },
  "STAGE_4": {
    "text": "По пути, вы спасаете вторую группу разведчиков. Оказавшись в отчаянной ситуации, они были на грани гибели, стая голодных волков загнала группу в пещеру, если бы не вы, эта пещера стала бы братской могилой для наших разведчиков. Стаю пришлось перебить, но это обеспечило нас сухим, жестким, но все таки мясом, а шкуры сгодились для того чтобы получше укутать детей, ведь вы нагнали людей опередивших вас и ушедших далеко вперед. Воистину счастливая встреча! Благодарные глаза группы разведчиков и согретых детей принесли новый всплеск надежды и общности в нашу группу.\nСпустя километры пути, ценою невероятных усилий, тебе вместе с твоими товарищами по несчастью, наконец, улыбается удача! Перед тобой открывается вид на идеальное место для поселения - лощина, окруженная холмами и деревьями, которые смогут защитить от порывов ледяной бури и обеспечат нас стройматериалами для жилища!\nТы и твои люди начинаете разбивать временный лагерь, строить паровой генератор для отопления и все постепенно налаживается. Жизнь кажется приобретает новый смысл в этом холодном и безжалостном мире. Теперь, вместе со своими союзниками и найденным местом для поселения, у вас появляется шанс выжить в этом ледяном аду. Но опасности еще впереди, и твои решения продолжат определять будущее твоей общины.\n\n На дворе 2125 год за окном мазанки 55 градусов ниже нуля, небольшая печка весело потрескивает и это потрескивание как будто бы успокаивает, однако в голову лезут не хорошие мысли, если вдруг начнется буря и температура опустится еще ниже маленькая буржуйка, вокруг которой, в перерывах между рабочими сменами вся община пытается ухватить капельку тепла и обогреть закоченевшие, загрубевшие от тяжелого труда руки, вас конечно же не спасет, к тому же большая часть добытой древесины ушла на постройку общего барака, рабочих рук катастрофически не хватает, и кому то придется спускаться в только что вырытую в промерзлой земле, не укрепленную шахту, для добычи драгоценного угля.\nПеред тобой стоит нелегкий выбор:\n\n 1. Объявить круглосуточные смены на ближайшие три дня, но ведь люди и так устали и вымотались, работая двойную смену в такой холод. Как они отреагируют ? А если бунт ? Нужно крепко подумать перед тем как решить!\n 2. Отправить в шахту детей, ведь это кажется самым логичным и обоснованным решением, кому как не юрким, маленьким ребятишкам лазать в узких проходах, добывая драгоценный черный уголь, который горит так долго и дарит столько тепла...\nВ конце концов без угля постройка генератора останется пустой затеей и все попытки выжить не приведут к успеху."
  },
  "STAGE_5": {
    "text": "С решимостью в сердце, ты и еще трое храбрецов решаете рискнуть и отбить у полярных медведей лощину, ведь вы так устали в дороге и вам нужна хотя бы маленькая передышка, без которой, вы вероятно все равно не сможете одолеть путь назад к поезду...\n\n Наступает время вступать в  неравную битву с дикими хищниками, и ты идешь на медведя, подумать только...\n\nАдреналин зашкаливает, время замедляет свой бег, кровь стучит в висках и вдруг, ты понимаешь что тебе наконец то тепло, ты бежишь на них первым, вопреки твоим наивным ожиданиям, медведи совсем не испугались ваших громких криков и махания руками, мишки совсем не собирались уступать вам облюбованные охотничьи угодья, в конце концов вы всего лишь кучка изможденны, испуганных, голодных, промерзших до мозга костей людишек, и в руках у вас всего лишь топоры да лопаты, а не то страшное огнестрельное оружие, вселявшее когда то ужас во все живое, именно это оружие и его эволюция, погоня за деньгами и властью привела человечество к этой конечной точке... Ну что человек, скажи мне ты ли сейчас венец эволюции?! или все таки полтонны живого мяса, двигающееся с непостижимой скоростью для такого великана, с огромными когтистыми лапами и оскаленной мордой издающей казалось бы воистину демонический рев.\n\n Все как один вступили в неравный бой! В порыве безумного рвения защитить своих людей тебе даже удается ранить одну зверюгу, но в конечном итоге, ты видишь лишь огромную когтистую лапу медведицы опускающуюся на тебя, то что это именно медведица ты понимаешь в последний миг, в этот самый миг в твоих стекленеющих глазах отражаются маленькие медвежата которых защитила Мама...\n\nТы не справился со своей задачей, и твоя группа, вероятно, погибнет без своего лидера. Твоя ноша оказалась слишком тяжелым испытанием. Твои решения провели тебя через множество вызовов, но, кажется, это стало концом твоего пути в этом умирающем мире."
  },
  "STAGE_6": {
    "text": "Решив не шутить с медведями , мы приняли решение возвращаться к поезду, как нам это удалось даже не передать словами, по пути мы потеряли Василия... В какой то момент он просто отказался идти дальше идти, просто взял и лег на снег, и не какие уговоры его не проняли. Мы пытались какое то время нести его по очереди на себе, но через сутки пути сами выбились из сил, настолько что повалились без сил в ближайший сугроб, со злостью взглянув на Василия мы обнаружили, что он по видимому уже как несколько часов мертв, он был весь окоченевший с обмороженными, черными как у мумии руками и посиневшим лицом. Мы оставили его в том сугробе... \n\nПутем невероятных усилий мы каким то чудом достигли точки откуда начинали свой путь, однако поезд оказался пустым, безжизненным и холодным,он словно грустно смотрел на вас своими глазами - окнами  кабины машиниста - моей кабины, будущей для меня домом последние несколько месяцев. По всей видимости, люди не дождались и ушли искать новый дом без меня...\n\n Посовещавшись мы приняли решение передохнуть, обогреться и пуститься в погоню за нашей ушедшей паствой. Следы на снегу вели на юг, свежие и хорошо видимые в глубоком снегу, они не могли уйти далеко, ведь с ними дети и весь скарб! В последние дни стоял крепкий мороз, и это не предвещало ничего хорошего - знаете как говорят? Затишье перед бурей, лишь бы успеть догнать их пока  не началась вьюга и следы не замело...\n\nПока мы набираемся сил,  время медленно утекает, и люди уходят все дальше.\n\nК моему великому сожалению проникнув в поезд с целью развести огонь и прикорнуть хотя бы пару часов нами были обнаружены 28 замерзших насмерть людей, видимо это те кто остались нас ждать до конца, пришлось их хоронить прямо в снегу, возле поезда не спать же с трупами в одном вагоне, сил и энтузиазма новой дороги это мероприятие конечно же не прибавило. Этот момент стал еще одним тяжелым ударом, напоминающем о хрупкости человеческой жизни и неотвратимости холода в этом серо-белом враждебном мире."
  },
  "STAGE_7": {
    "text": "Идет второй месяц изнуряющего практически круглосуточно труда, люди вымотаны до предела. Последним своим распоряжением ты объявляешь детский труд законным, тем самым обеспечиваешь взрослым передышку а детей отправляешь в угольные шахты, в которых дети безропотно трудятся не покладая рук,  ради общего блага,они добывают свою норму угля. В это время взрослые тоже не сидят без дела и завершают строительство парового генератора, наконец, в общем бараке появляется отопление, горячая вода и электричество! Жизнь налаживается, появляются новые надежды: Люди охотятся, рыбачат, строят небольшую теплицу, которую удается отопить и осветить благодаря генератору, в этой теплице уже даже показались первые неокрепшие ростки самых разнообразных садовых культур, урожай обещает быть обильным. Ко всеобщей радости ощенилась одна из спасенных с поезда собак!\nКазалось бы все идет хорошо, но ведь сколько раз ты сам себе говорил, себе что нужно первым делом укрепить своды, что в шахтах небезопасно и детям там не место, но все откладывал на потом, а ведь дети несмышленые и совершенно не понимают куда копают, и взрослые не могут пролезть так глубоко как дети, чтобы посмотреть что происходит в глубине шахт. И...\nКонечно же случилось непоправимое...\nНеукрепленные своды шахты рухнули в один миг погребя под собой, большую часть детей. Спаслись только пара мальчишек, что были в лазарете с высокой температурой, и одна странная девочка. Эта девочка совсем недавно потеряла маму, единственного родного человека оставшегося на всем белом свете, мама постоянно ворчала и чтобы получать двойной паек для себя и для девочки практически каждый день брала двойную смену на лесозаготовках, в один печальный день она внезапно заболела, пневмония унесла ее жизнь в считанные дни, спасти маму девочки к сожалению не удалось, но девочка запомнила как мама постоянно ворчала что это Капитан заставляет её горбатится сверх нормы и это он будет виноват если она поставит педали в угол, раньше времени и девочка запомнила мамины слова, после смерти мамы, взрослые постоянно шпыняли надоедливую, непослушную девочку которая  постоянно таскалась за ними, а один дядя ее даже ударил, Девочка прилюдно ругала Капитана, обвиняя его в смерти мамы, но девочку никто не слушал,она  часто сбегала с работы на шахтах, садилась напротив барака и пристально смотрела на Лидера что боготворили все вокруг, кроме нее... Однажды она услышала от каких то мужчин что дети вообще обуза и без них будет только лучше за детьми все время приходится следить, из-за детей чуть все не погибли при переходе и вообще пусть работают а то  зазря переводят дефицитную провизию, с этих пор девочка решила вовсе не ходить на работы, а после катастрофы на шахте девочка куда то пропала и про нее никто даже не вспомнил, подумали что она была с остальными детьми в шахтах. Но однажды ночью обиженная на весь мир девочка вернулась в поселение и решила жестоко отомстить всем, всем оставшимся в этом бездушном мире взрослым, за то что они убили ее МАМУ, и за то что они убили ее друзей!  Девочка взяла последнюю оставшуюся канистру керосина которую берегли как зеницу ока на черный день и обильно полила барак со всех 4 сторон, особенно дверь, методично закрыла все ставни на окнах, кинула  зажжённую спичку, отошла в сторонку и стала спокойно наблюдать как люди кричат и заживо горят в своих постелях, барак горел, пламя ревело и одна из стен обрушилась, девочка заметила своего самого лютого врага среди взрослых - ТЕБЯ!!! обуянного пламенем с головы до ног, она подошла поближе заглянула в твое обгоревшее в пламени пожара лицо, улыбнулась, подмигнула тебе, взяла за руки двух спасенных ею мальчишек, что таились все это время в тени, повернулась к тебе спиной и шагнула в вместе с ними в холодную полярную ночь...\nТаков бесславный конец твоего жизненного пути!"
  },
  "HAPPY_END": {
    "text": "Последним указом тебе пришлось объявить несколько дней круглосуточных смен. Конечно, нашлись недовольные, которые попытались бунтовать и провоцировать остальных. Некоторых даже пришлось поколотить для острастки. Однако крайние меры и едкое чувство неизбежности, чувство приближающейся беды, требовали проявления твердости характера, и ты был вынужден отстаивать свое лидерство с помощью грубой физической силы. Ты знал, почему тебе нельзя медлить, и не зря у тебя уже неделю ныл твой старый перелом да и собаки в последнее время вели себя беспокойно, и все говорило об одном, быть сильной буре. Однажды утром температура сначала поднялась аж на 20 градусов, подобного явления не небывало много месяцев, на улице повалил снег огромными  такими хлопьями, сейчас таких снегопадов не бывает... Народ вывалил на улицу и начал дурачится, лепить снежные бабы, играть в снежки и всячески радоваться потеплению, но уже к вечеру подул холодный пронизывающий ветер...\n\n Ночью температура резко упала, и уже через несколько часов наступил кромешный ад, ветер завывал так что не слышно было друг друга, даже если кричать на прямо на ухо, кто-то пошутил что градусник просто напросто кончился, когда его делали никто и представить себе не мог что такая низкая температура может кому то понадобится на шкале обыкновенного уличного термометра, так продолжалось 5 дней, кромешная тьма, вой ветра, хорошо что снегом занесло барак так что он оказался как будто бы в шубе, снегом забило все щели, и из за толщины снежного покрова шум ветра значительно утих, внутри было относительно тепло, так как все прижались к друг другу и понемногу подтапливали печь, пристально следя чтобы дымоход окончательно не замело снегом и все не задохнулись угарным газом, большую часть времени люди либо молились либо тихонько переговаривались меж собой, кто то просто причитал, а кто то шутил что наконец выспится за все сверх урочные смены, в целом атмосфера царила дружеская не смотря на наше бедственное положение, однако каким то 5 чувством люди понимали что совсем скоро буря утихнет и они выйдут наружу ну или в крайнем случае умрут в тепле и все вместе...Так прошло 5 бесконечных дней.\n\nНа 6 день буря стала утихать и люди стали попытались выйти, но не тут то было толщина снежного кокона вокруг барака была такой, что пришлось еще двое суток прокапывать тоннель наружу!\n\n ЭПИЛОГ, спустя 67 лет...\n\nТы уже глубокий старик, сидишь на берегу небольшого пруда в кресле качалке нежно укутанный пуховым пледом, с тех пор утекло столько воды но такое чувство что с той самой бури ты так никогда в жизни и не смог до конца согреться,  как бы жарко не было на топлено в доме, тебе всегда немного прохладно, и хотя твоя память с каждым днем покидает тебя, ты все еще помнишь как спустя несколько лет, после тех 5 страшных дней и ночей, ты стал примечать что небо постепенно становится все светлее и светлее, температура окружающей среды постепенно поднимается, и это не проделки атмосферного давления, периоды потепления становились все длиннее и длиннее, ты наконец обрел твердую уверенность что на своем пути, тебе удалось провести свой малочисленный народец по сааааамому краю пропасти, вам всем пришлось многим пожертвовать, многие потеряли родных и близких но все таки вы справились и в этом есть твоя не малая заслуга. Теперь будучи глубоко уважаемым древним старцем, вечно ворчащим что-то себе под нос, иногда потрясая клюкой  над многочисленным головами внуков, ты можешь позволить себе немного приукрасить рассказ о тех давно минувших днях...\n\n КОНЕЦ "
  }
}